In [3]:
import pandas as pd

s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
# custom index

s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s)

a    10
b    20
c    30
dtype: int64

In [3]:
# creating series from lists,tuple, numpy and dictionaries

list1 = [10,20,30,50,40,70]
ls_to_se = pd.Series(list1)
print(ls_to_se)

0    10
1    20
2    30
3    50
4    40
5    70
dtype: int64

In [5]:
# using tuple

tup1 = (10,20,30,50,40,70)
tup_to_se = pd.Series(tup1)
print(tup_to_se)

0    10
1    20
2    30
3    50
4    40
5    70
dtype: int64

In [7]:
# using dictionaries

dict1 = {'a': 'hello', 'b': 'bye', 'c': 'hai'}
d_to_se = pd.Series(dict1)
print(d_to_se)

a    hello
b      bye
c      hai
dtype: object

In [9]:
# using numpy arrays

import numpy as np

arr1 = np.array([10,20,40,30,50,60])
arr1_to_se = pd.Series(arr1)
print(arr1_to_se)

0    10
1    20
2    40
3    30
4    50
5    60
dtype: int32

In [1]:
# Create a Series from a List with custom index
# Create a Series from a Dictionary and print only values (use series_name.values)
# Access by Index Position (s[0]...)
# Slicing Elements
# Add two Series
# Filter elements greater than 15 (s[s>15])

In [2]:
# dataframe creation - using dictionary

import pandas as pd

data = {
    'Name': ['Amit', 'Bezek', 'Charan'],
    'Age': [21, 22, 23],
    'City': ['Delhi', 'Mumbai', 'Chennai']
}

df = pd.DataFrame(data)
print(df)

     Name  Age     City
0    Amit   21    Delhi
1   Bezek   22   Mumbai
2  Charan   23  Chennai

In [3]:
# using lists

data = [[1, 'Apple'], [2, 'Banana'], [3, 'Orange']]

df = pd.DataFrame(data, columns=['ID', 'Fruit'])
print(df)

   ID   Fruit
0   1   Apple
1   2  Banana
2   3  Orange

In [5]:
# using numpy

import numpy as np
arr = np.array([[10, 20], [30, 40], [50, 60]])

df = pd.DataFrame(arr, columns=['Col1', 'Col2'])
print(df)

   Col1  Col2
0    10    20
1    30    40
2    50    60

In [10]:
# using list of dicitionary
data = [
    {'Name': 'Anamika', 'Age': 21,'major':'computer science'},
    {'Name': 'Bhagavan', 'Age': 22,'major':'Engineering'},
    {'Name': 'Chaava', 'Age': 23,'major':'Mathematics'}
]

df = pd.DataFrame(data)
print(df)

       Name  Age             major
0   Anamika   21  computer science
1  Bhagavan   22       Engineering
2    Chaava   23       Mathematics

In [9]:
# Reading CSV using read_csv()

df = pd.read_csv(r"C:\Users\admin\Desktop\titanic.csv")
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [10]:
# inspecting data

print("first 5 lines")
print(df.head())
print()

print("last 5 lines")
print(df.tail())
print()

print("number of rows and columns")
print(df.shape)
print()

print("info about the dataframe")
print(df.info())
print()

print("statistics of numerical columns")
print(df.describe())
print()

first 5 lines
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

last 5 lines
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

number of rows and columns
(891, 12)

info about the dataframe
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

statistics of numerical columns
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [19]:
# metadata

print(df.columns)
print("\n",df.index)
print("\n",df.dtypes)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

 RangeIndex(start=0, stop=891, step=1)

 PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [20]:
print(df.memory_usage())

Index           128
PassengerId    7128
Survived       7128
Pclass         7128
Name           7128
Sex            7128
Age            7128
SibSp          7128
Parch          7128
Ticket         7128
Fare           7128
Cabin          7128
Embarked       7128
dtype: int64

In [ ]:
'''
1. Write a Python function that wraps the head() method and takes an optional parameter n, where the default value of n is 10. 
   Use this function to display the first 10 rows of a pandas DataFrame containing the columns Name, Age, and City columns
2. calculate the basic descriptive statistics (like mean, std, min, max, etc.) of the Age column in a pandas DataFrame?
3. check the data types and the number of non-null values for each column in a DataFrame? '''

In [22]:
# .loc and .iloc

df_emp=pd.read_csv(r"C:\Users\admin\Desktop\VU\sample_employees.csv")
df_emp

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
0,1,Amit,23,Delhi,50000,IT,1,4.2,Active,M
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
2,3,Chirag,31,Delhi,58000,IT,6,4.5,Active,M
3,4,Divya,22,Chennai,49000,Finance,2,4.0,Active,F
4,5,Esha,27,Hyderabad,60000,HR,3,4.3,Active,F

In [26]:
df_emp.loc[2] # with index label as 2 - provided the index is an integer

ID                 3
Name          Chirag
Age               31
City           Delhi
Salary         58000
Dept              IT
Experience         6
Rating           4.5
Status        Active
Gender             M
Name: 2, dtype: object

In [28]:
df_emp.loc[:, ["Name", "Salary", "Dept"]] # with all the rows and specific columns

     Name  Salary     Dept
0    Amit   50000       IT
1   Beena   62000       HR
2  Chirag   58000       IT
3   Divya   49000  Finance
4    Esha   60000       HR

In [30]:
df_emp.loc[1:3, ["Name", "Age", "City"]] # with sepcific columns

     Name  Age     City
1   Beena   29   Mumbai
2  Chirag   31    Delhi
3   Divya   22  Chennai

In [11]:
#df_emp.loc[df_emp["Salary"] > 55000, ["Name", "Salary"]] # conditonal selection with column labels
df_emp.loc[df_emp["Salary"] > 55000]

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
2,3,Chirag,35,Delhi,58000,IT,6,4.5,Active,M
4,5,Sam,29,Hyderabad,60000,HR,3,4.3,Active,F

In [7]:
df_emp.loc[df_emp["City"] == "Delhi"] # filter

   ID    Name  Age   City  Salary Dept  Experience  Rating  Status Gender
0   1    Amit   23  Delhi   50000   IT           1     4.2  Active      M
2   3  Chirag   31  Delhi   58000   IT           6     4.5  Active      M

In [6]:
# modify values in specific rows
df_emp.loc[2, 'Age'] = 35
print(df_emp)

   ID    Name  Age       City  Salary     Dept  Experience  Rating    Status  \
0   1    Amit   23      Delhi   50000       IT           1     4.2    Active
1   2   Beena   29     Mumbai   62000       HR           4     3.8  Resigned
2   3  Chirag   35      Delhi   58000       IT           6     4.5    Active
3   4   Divya   22    Chennai   49000  Finance           2     4.0    Active
4   5    Esha   27  Hyderabad   60000       HR           3     4.3    Active

  Gender
0      M
1      F
2      M
3      F
4      F

In [10]:
df_emp.loc[4, ['Name', 'Age']] = ['Sam', 29]
df_emp

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
0,1,Amit,23,Delhi,50000,IT,1,4.2,Active,M
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
2,3,Chirag,35,Delhi,58000,IT,6,4.5,Active,M
3,4,Divya,22,Chennai,49000,Finance,2,4.0,Active,F
4,5,Sam,29,Hyderabad,60000,HR,3,4.3,Active,F

In [13]:
df_emp.loc[[0, 3, 4], 'Age'] = 40
df_emp

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
0,1,Amit,40,Delhi,50000,IT,1,4.2,Active,M
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
2,3,Chirag,35,Delhi,58000,IT,6,4.5,Active,M
3,4,Divya,40,Chennai,49000,Finance,2,4.0,Active,F
4,5,Sam,40,Hyderabad,60000,HR,3,4.3,Active,F

In [ ]:
'''
1. select a specific row in a DataFrame using loc[]?
2. select multiple rows using loc[] based on their index labels?
3. select both specific rows and specific columns using loc[]?
4. modify values in specific rows and columns using loc[]?
5. use loc[] to update values in a column based on a condition?
6. select multiple columns and update their values at once for specific rows?
7. Given the DataFrame, how to select the rows where the value in the 'Age' column is greater than 30 using loc[]? '''

In [1]:
import pandas as pd

data1 = {
    'Name': ['Anita', 'Bharath', 'Chitra', 'Deepak', 'Esha'],
    'Department': ['CSE', 'ECE', 'EEE', 'MECH', 'CSE'],
    'Marks': [85, 78, 92, 67, 88],
    'Attendance': [90, 85, 95, 70, 92]
}

students = pd.DataFrame(data1)
print(students)

      Name Department  Marks  Attendance
0    Anita        CSE     85          90
1  Bharath        ECE     78          85
2   Chitra        EEE     92          95
3   Deepak       MECH     67          70
4     Esha        CSE     88          92

In [ ]:
# solve quesitons
'''
1.Select the details of the student with index 2 using loc.

2.Select Name and Marks columns for all students using loc.

3.Select rows where Department is 'CSE'.

4.Select students who have Marks greater than 80 and Attendance greater than 85.

5.Change the Marks of Deepak to 75 using loc.

6.Retrieve only the Name of students whose Attendance is above 90.

7.Select rows with indices 1 to 3 using slicing with loc.

8.Add 5 bonus marks to students from the CSE department using loc.

9.Select all columns for the student named ‘Chitra’ using loc.

10.Replace all marks below 70 with 70 using conditional loc assignment.'''

In [8]:
# iloc[] — Index-position selection (integer-based)
 
df_emp.iloc[0]

ID                 1
Name            Amit
Age               23
City           Delhi
Salary         50000
Dept              IT
Experience         1
Rating           4.2
Status        Active
Gender             M
Name: 0, dtype: object

In [9]:
df_emp.iloc[0:3, 0:4]

   ID    Name  Age    City
0   1    Amit   23   Delhi
1   2   Beena   29  Mumbai
2   3  Chirag   31   Delhi

In [10]:
df_emp.iloc[[1, 3], [2, 4]]

   Age  Salary
1   29   62000
3   22   49000

In [11]:
df_emp.iloc[-2:, -3:]

   Rating  Status Gender
3     4.0  Active      F
4     4.3  Active      F

In [24]:
#df_emp[df_emp["Salary"] > 55000]

#df_emp[(df_emp["Salary"] > 55000) & (df_emp["Dept"] == "IT")]

df_emp[(df_emp["City"] == "Delhi") | (df_emp["City"] == "Mumbai")]

#df_emp[df_emp["City"].isin(["Delhi", "Hyderabad"])]

   ID    Name  Age    City  Salary Dept  Experience  Rating    Status Gender
0   1    Amit   23   Delhi   50000   IT           1     4.2    Active      M
1   2   Beena   29  Mumbai   62000   HR           4     3.8  Resigned      F
2   3  Chirag   31   Delhi   58000   IT           6     4.5    Active      M

In [17]:
# sorting by index
df_emp.sort_index(ascending=False) # default is ascending

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
4,5,Esha,27,Hyderabad,60000,HR,3,4.3,Active,F
3,4,Divya,22,Chennai,49000,Finance,2,4.0,Active,F
2,3,Chirag,31,Delhi,58000,IT,6,4.5,Active,M
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
0,1,Amit,23,Delhi,50000,IT,1,4.2,Active,M

In [28]:
# sorting by values

# df_emp.sort_values(by="Salary")

# df_emp.sort_values(by="Salary", ascending=False)
df_emp.loc[4,['Salary']]=30000

df_emp.sort_values(by=["Dept", "Salary"], ascending=[True, False]) # first by Dept (A→Z) (primary), then Salary high→low (secondary-within each dept)

,ID,Name,Age,City,Salary,Dept,Experience,Rating,Status,Gender
3,4,Divya,22,Chennai,49000,Finance,2,4.0,Active,F
1,2,Beena,29,Mumbai,62000,HR,4,3.8,Resigned,F
4,5,Esha,27,Hyderabad,30000,HR,3,4.3,Active,F
2,3,Chirag,31,Delhi,58000,IT,6,4.5,Active,M
0,1,Amit,23,Delhi,50000,IT,1,4.2,Active,M

In [ ]:
# .iloc questions
'''
1.Select the first row using iloc.

2.Select the first three rows using slicing with iloc.

3.Select the second and third columns for all rows using iloc.

4.Select the Marks of the third student using iloc.

5.Select the Name and Attendance of the last two students using iloc.

6.Retrieve rows 1, 3, and 4 using list indexing in iloc.

7.Retrieve columns 0 and 2 for the first four rows using iloc.

8.Change the Attendance of the second student (index 1) to 95 using iloc.

9.Print the Marks of the first three students using slicing.

10.Select every alternate row (0, 2, 4, …) using step slicing with iloc.'''

In [26]:
# handling missing data

import numpy as np

data = {
    "Student": ["Tilak", "Sarojini", "Bhagath", "Jhansi", "Vallabhai"],
    "Department": ["CSE", "ECE", "EEE", np.nan, "CSE"],
    "Marks": [85, np.nan, 78, 92, np.nan],
    "Attendance": [90, 85, np.nan, 95, 80]
}

df_students = pd.DataFrame(data)
print(df_students)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [27]:
# detecting missing values

df_students.isna()

   Student  Department  Marks  Attendance
0    False       False  False       False
1    False       False   True       False
2    False       False  False        True
3    False        True  False       False
4    False       False   True       False

In [28]:
df_students.isna().sum() # NaNs per column count

Student       0
Department    1
Marks         2
Attendance    1
dtype: int64

In [43]:
# Basic fillna() Usage - Replace all missing values with a single value

df1=df_students.fillna(0)
print(df1)
#print(df_students)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    0.0        85.0
2    Bhagath        EEE   78.0         0.0
3     Jhansi          0   92.0        95.0
4  Vallabhai        CSE    0.0        80.0

In [48]:
import numpy as np

data = {
    "Student": ["Tilak", "Sarojini", "Bhagath", "Jhansi", "Vallabhai"],
    "Department": ["CSE", "ECE", "EEE", np.nan, "CSE"],
    "Marks": [85, np.nan, 78, 92, np.nan],
    "Attendance": [90, 85, np.nan, 95, 80]
}

df_students = pd.DataFrame(data)
print(df_students)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [49]:
# Fill missing values only in “Marks” column

df2 = df_students.copy()
df2["Marks"] = df2["Marks"].fillna(df2["Marks"].mean())
print(df2)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE   85.0        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE   85.0        80.0

In [50]:
df3 = df_students.copy()
df3["Department"] = df3["Department"].fillna("Unknown")
print(df3)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi    Unknown   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [52]:
# forward interpolation
df5 = df_students.copy()
df5 = df5.fillna(method="ffill")
print(df5)
print()
print(df_students)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE   85.0        85.0
2    Bhagath        EEE   78.0        85.0
3     Jhansi        EEE   92.0        95.0
4  Vallabhai        CSE   92.0        80.0

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [53]:
# backward interpolation
df6 = df_students.copy()
df6 = df6.fillna(method="bfill")
print(df6)
print()
print(df_students)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE   78.0        85.0
2    Bhagath        EEE   78.0        95.0
3     Jhansi        CSE   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [54]:
df_drop_any = df_students.dropna() # without any missing values
print(df_drop_any)

  Student Department  Marks  Attendance
0   Tilak        CSE   85.0        90.0

In [55]:
df_drop_all = df_students.dropna(how="all") # drops rows/cols only if all the values are null
print(df_drop_all)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE    NaN        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE    NaN        80.0

In [56]:
df_drop_marks = df_students.dropna(subset=["Marks"]) # dropping rows which has missing values
print(df_drop_marks)

   Student Department  Marks  Attendance
0    Tilak        CSE   85.0        90.0
2  Bhagath        EEE   78.0         NaN
3   Jhansi        NaN   92.0        95.0

In [58]:
# interpolation

df_inter = df_students.copy()
df_inter["Marks"] = df_inter["Marks"].interpolate()
df_inter["Attendance"] = df_inter["Attendance"].interpolate()
print(df_inter)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE   81.5        85.0
2    Bhagath        EEE   78.0        90.0
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE   92.0        80.0

In [60]:
# grouping - marks column filled with mean as aggreagation has to be done

df = df_students.copy()
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())  # mean = 85
print(df)

     Student Department  Marks  Attendance
0      Tilak        CSE   85.0        90.0
1   Sarojini        ECE   85.0        85.0
2    Bhagath        EEE   78.0         NaN
3     Jhansi        NaN   92.0        95.0
4  Vallabhai        CSE   85.0        80.0

In [61]:
dept_mean = df.groupby("Department")["Marks"].mean()
print(dept_mean)

Department
CSE    85.0
ECE    85.0
EEE    78.0
Name: Marks, dtype: float64

In [62]:
dept_agg = df.groupby("Department")["Marks"].agg(["mean", "min", "max", "count"])
print(dept_agg)

            mean   min   max  count
Department
CSE         85.0  85.0  85.0      2
ECE         85.0  85.0  85.0      1
EEE         78.0  78.0  78.0      1

In [63]:
# transform() — Keeps Original Row Size -Subtract each student’s marks from their department mean

df["Marks_diff"] = df["Marks"] - df.groupby("Department")["Marks"].transform("mean")
print(df)

     Student Department  Marks  Attendance  Marks_diff
0      Tilak        CSE   85.0        90.0         0.0
1   Sarojini        ECE   85.0        85.0         0.0
2    Bhagath        EEE   78.0         NaN         0.0
3     Jhansi        NaN   92.0        95.0         NaN
4  Vallabhai        CSE   85.0        80.0         0.0

In [ ]:
# solutions for .loc questions

#students.loc[students['Department'] == 'CSE']
#students.loc[(students['Marks'] > 80) & (students['Attendance'] > 85)]
#students.loc[students['Name'] == 'Deepak', 'Marks'] = 75
#students.loc[students['Attendance'] > 90, 'Name']
#students.loc[1:3]
#students.loc[students['Department'] == 'CSE', 'Marks'] += 5
#students.loc[students['Name'] == 'Chitra']
#students.loc[students['Marks'] < 70, 'Marks'] = 70

In [ ]:
# solutions for iloc

#students.iloc[0]
#students.iloc[0:3]
#students.iloc[:, 1:3]
#students.iloc[2, 2]
#students.iloc[-2:, [0, 3]]
#students.iloc[[1, 3, 4]]
#students.iloc[:4, [0, 2]]
#students.iloc[1, 3] = 95
#students.iloc[:3, 2]
#students.iloc[::2]